REQUIRED_COLUMNS = {
    "task1": ["商品品类", "进货价格", "实际售价", "销售数", "利润"],
    "task2": ["区域", "商品品类", "利润"],
    "task3": ["日期", "利润"],
    "task4": ["商品品类", "销售额", "利润", "实际售价", "销售数"]
}

TIER_1_CITIES = ['北京', '上海', '广州', '深圳']
TIER_2_CITIES = ['昆明', '福州', '厦门', '无锡', '哈尔滨', '长春', '宁波', '济南', '大连', '郑州']
TIER_3_CITIES = ['兰州', '海口', '乌鲁木齐', '贵阳', '银川', '西宁', '呼和浩特', '拉萨']

REGION_MAPPING = {
    '华南': ['广东', '广西', '海南', '福建'],
    '华东': ['上海', '江苏', '浙江', '安徽', '江西', '山东'],
    '华北': ['北京', '天津', '河北', '山西', '内蒙古'],
    '东北': ['辽宁', '吉林', '黑龙江'],
    '西南': ['重庆', '四川', '贵州', '云南', '西藏'],
    '西北': ['陕西', '甘肃', '青海', '宁夏', '新疆'],
    '华中': ['河南', '湖北', '湖南']
}